Revit 2027 API
NavisworksExportOptions.ExportParts Property
 True to export Revit part elements, false to export the original parent elements. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportParts { get; set; }
Public Property ExportParts As Boolean
	Get
	Set
public:
property bool ExportParts {
	bool get ();
	void set (bool value);
}
member ExportParts : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace